{
	"projects": [
		{
			"name": "DEXCOM",
			"title": "dexcom",
			"url": "dexcom",
			"description": ""
		},
		{
			"name": "BUROW",
			"title": "burow",
			"url": "burow",
			"description": "",
			"info": [
				{
					"title": "Role",
					"content": "Visual design, web development, branding"
				},
				{
					"title": "Design Tools",
					"content": "Sketch, Illustrator"
				},
				{
					"title": "Development Tools",
					"content": "HTML, CSS, JavaScript, Node.js, API Linking"
				},
				{
					"title": "Date",
					"content": "April 2018 - June 2018"
				}
			],
			"blocks": [
				{
					"title": "Objective",
					"text": true,
					"content": "Develop a full-stack application focusing on interacting with real world data."
				},
				{
					"title":"Work In Progress",
					"text": true,
					"caption": "Brought together by the UC San Diego course, ENG100D - Design for Development, our team is diligently working on the development of this project. Stay tuned for more details!"
				}
			]
		},
		{
			"name": "BLYSS",
			"title": "blyss",
			"url": "blyss",
			"description": "",
			"info": [
				{
					"title": "Role",
					"content": "Visual design, web development"
				},
				{
					"title": "Tools",
					"content": "HTML, CSS, JavaScript, Node.js (Express + Handlebars)"
				},
				{
					"title": "Date",
					"content": "January 2018 - March 2018"
				}
			],
			"blocks": [
				{
					"title": "Objective",
					"text": true,
					"content": "Design and develop a mobile web application focused on the principles of interaction design."
				},
				{
					"title": "The Quantified Self",
					"text": true,
					"content": "With the help of digital devices, we have an unprecedented ability to track our behaviors, habits, and thoughts. But turning data about ourselves and our communities into valuable insights is still remarkably difficult. My studio explored ways to support monitoring, reflection, and behavior change by collecting, consuming, and sharing personally relevant information. We considered how might we help people learn more about their everyday lives through self-tracking, and how might we help people draw insights from the mass of data they collect about themselves."
				},
				{
					"title": "Who is Our Audience?",
					"text": true,
					"content": "This section is currently under construction, check back later for updates!"
				},
				{
					"title":"Final Touches",
					"link": true,
					"linkurl": "https://blyss.herokuapp.com/",
					"content": "Come check out the live prototype here!"

				}
			]
		},
		{
			"name": "PORTFOLIO",
			"title": "portfolio",
			"url": "portfolio",
			"type": "UI Design & Dev",
			"description": "Today’s professional atmosphere is more competitive than ever before. Being an undergraduate student who is applying to UI/UX design and engineering internships, I needed to have a website portfolio where I could display my projects and establish an online presence to potential employers. Building this portfolio would not only allow me to showcase my abilities as a designer and developer, but would also provide me an opportunity to apply the concepts and skills I have learned through my coursework and on my own time.",
			"info": [
				{
					"title": "Roles",
					"content": "Sole web designer and developer. Fully contributed to design and implementation processes."
				},
				{
					"title": "Design Tools",
					"content": "Sketch, Adobe XD, Illustrator, Photoshop"
				},
				{
					"title": "Development Tools",
					"content": "HTML, CSS, Node.js (Express + Handlebars), Sass, Gulp"
				},
				{
					"title": "Skills",
					"content": "Visual design, branding, UI design, front-end development, back-end development"
				},
				{
					"title": "Date",
					"content": "March 2018 - Current"
				},
				{
					"title": "Resources",
					"content": "<a href=\"https://github.com/alphyne/portfolioV2\">Github Repo</a>"
				}
			],
			"blocks": [
				{
					"header": "Objective",
					"sections": [
						{
							"column-two": true,
							"text": true,
							"content": "To showcase my adaptive skillset by designing and developing my personal website portfolio."
						}
					]
				},
				{
					"header": "Design",
					"sections": [
						{
							"column-one": true,
							"subheader": true,
							"title": "Dark Design",
							"image": true,
							"src": "/images/ref.png",
							"text": true,
							"content": "I have always had an afinity towards dark-themed designs. While they are capable of elegance and sophistication, dark designs can also be edgy and striking. I took inspiration from magazine spreads that I thought are bold yet balanced."
						},
						{
							"column-two": true,
							"subheader": true,
							"title": "Hearing Color",
							"image-and-text": true,
							"src": "/images/color.png",
							"content": "An album's artwork is an extension of the music itself. It enhances the listener's experience by complementing the mood the artist is conveying. These are some albums that I appreciate for both their music and their aesthetics, and that inspired me to play with color palettes surrounding dark design."
						}
					]
				},
				{
					"header": "Development",
					"sections": [
						{
							"column-one": true,
							"subheader": true,
							"title": "Trial and Error",
							"text": true,
							"content": "Mock-ups coming soon."
						},
						{
							"column-one": true,
							"text": true,
							"content":"In order to hone my web development skills, I challenged myself to build my portfolio from the ground up. Utilizing my knowledge of HTML, CSS and Javascript, I aimed to complete a sleek platform to showcase my work. My education at University of California, San Diego has allowed me to keep expanding my development arsenal by introducing tools that I can incorporate into my portfolio, such as Node.js (Express + Handlebars)."
						}
					]
				}
			]
		}
	]
}

