{
	"projects": [
		{
			"name": "DEXCOM",
			"title": "Dexcom",
			"url": "dexcom",
			"type": "UX Engineering + Speculative Design",
			"description": "",
			"info": [
				{
					"title": "Title",
					"content": "UX Design Intern (IT)"
				},
				{
					"title": "Date",
					"content": "Jul 2018 - Sep 2018"
				}
			]
		},
		{
			"name": "BUROW",
			"title": "Burow",
			"url": "burow",
			"type": "UX Design + Dev",
			"description": "What makes a place feel like a home? Burow is a desktop web application that helps people find the perfect neighbourhood to suit their needs. Focusing on livability metrics including price, walkability, and school rating, Burow makes it easy to discover the ideal location to complement your lifestyle.",
			"info": [
				{
					"title": "Roles",
					"content": "Led design and development of results page. Co-led brand design. UX completed as a team."
				},
				{
					"title": "Skills",
					"content": "UX engineering, web design, brand design, prototyping"
				},
				{
					"title": "Team",
					"content": "Aman Gupta, Emily Nguyen, Joel Sequeira"
				},
				{
					"title": "Design + Dev Tools",
					"content": "Sketch, Illustrator, HTML, CSS, Javascript, Node.js, React, API Linking"
				},
				{
					"title": "Date",
					"content": "Apr 2018 - Jun 2018 (10 weeks)"
				},
				{
					"title": "Resources",
					"content": "<a href=\"https://github.com/joelseq/COGS121\">Github repo</a> / <a href=\"https://vimeo.com/312224432\">Demo video</a> / <a href=\"https://burow.xyz\">burow.xyz</a>"
				}
			],
			"blocks": [
				{
					"header": "Problem Space",
					"sections": [
						{
							"column-two": true,
							"text": true,
							"content": "When searching for a new place to live, popular real estate apps such as Zillow, Trulia, and Redfin first ask users for their desired location. Once selected, users can narrow down their results using metrics including price and number of bedrooms/bathrooms. Listings that catch the user’s interest can then be further researched in order to find their school rating, walkability, and more."
						},
						{
							"column-one": true,
							"text": true,
							"content": "This user flow is intuitive for people who already have in mind a specific location they want to relocate to, however what if it were the opposite and you are trying to find the right neighbourhood for you?"
						}
					]
				},
				{
					"header": "Solution",
					"sections": [
						{
							"column-one": true,
							"text": true,
							"content": "To solve this problem, our team decided to reverse the user flow of standard real estate apps, allowing users to parse through neighbourhood data at a macro level. Our application sorts neighbourhoods within a city by the following criteria of price, walkability, and school rating. The variability of these metrics can be drastic, even in close proximity neighbourhoods. Because of this, this user flow benefits users who are unfamiliar with the city they are moving to."
						},
						{
							"column-one": true,
							"text": true,
							"content": "<span class=\"bold underline\">Existing Solution</span><br>Enter location → Receive listings → Use criteria to sort through listings"
						},
						{
							"column-one": true,
							"text": true,
							"content": "<span class=\"bold underline\">Proposed Solution</span><br>Enter city → Choose criteria → Receive neighbourhood results"
						}
					]
				},
				{
					"header": "Research",
					"sections": [
						{
							"subheader": true,
							"title": "Storyboarding",
							"column-one": true,
							"text": true,
							"content": "In order to empathize with our target users, we drafted two storyboards with possible scenarios within the scope of our application."
						},
						{
							"column-one": true,
							"image": true,
							"src": "images/burow/storyboards.gif"
						},
						{
							"subheader": true,
							"title": "Competitive Analysis",
							"column-one": true,
							"image": true,
							"src": "images/burow/comp-analysis.gif",
							"text": true,
							"content": "Zillow, Trulia, and Redfin utilize picturesque real estate photography, clean visual lines and crisp typefaces to establish a professional, trustworthy interface. This gives them a sense of credibility and safety, however at the cost of appearing apathetic and stock."
						}
					]
				},
				{
					"header": "Prototyping",
					"sections": [
						{
							"column-two": true,
							"text": true,
							"content": "To help us explore different approaches to our solution we prototyped mobile and desktop variants of our application. Our solution needed to give users similar functionality to popular real estate apps, so we included familiar features such as price search criteria and an interactive map."
						},
						{
							"column-one": true,
							"text": true,
							"content": "The major difference in our solution is the focus of livability criteria in the search algorithm. To reflect this, we included visualizations that bring attention to neighbourhoods that best fit the user’s selected criteria. This way areas that are a ‘best fit’ are easy to pinpoint amongst all of the search results available to the user."
						},
						{
							"subheader": true,
							"title": "Mobile Variant",
							"column-one": true,
							"image": true,
							"src": "images/burow/prototype1.gif"
						},
						{
							"subheader": true,
							"title": "Web Variant",
							"column-one": true,
							"image": true,
							"src": "images/burow/prototype2.gif"
						}
					]
				},
				{
					"header": "Brand Design",
					"sections": [
						{
							"column-two": true,
							"text": true,
							"content": "Because our application does not provide listings or connect users with online real estate agencies, our team decided to switch out the professional look for a cozy, welcoming atmosphere. To produce a homey feel, we followed a theme of burrowing animals and leaned towards warm earth tones and typefaces with gentle curves."
						},
						{
							"column-one": true,
							"quote": true,
							"content": "\"Burow - Dig around and find the neighbourhood that fits your needs!\""
						},
						{
							"column-one": true,
							"subheader": true,
							"title": "Moodboard",
							"image": true,
							"src": "images/burow/moodboard.png"
						},
						{
							"column-one": true,
							"subheader": true,
							"title": "Style Guide",
							"image": true,
							"src": "images/burow/style-guide.gif"
						}
					]
				},
				{
					"header": "Final Build + Demo",
					"sections": [
						{
							"column-one": true,
							"video": true,
							"content": "<div style=\"padding:56.25% 0 0 0;position:relative;\"><iframe src=\"https://player.vimeo.com/video/312224432?byline=0&portrait=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div><script src=\"https://player.vimeo.com/api/player.js\"></script>"
						}
					]
				},
				{
					"header": "Takeaways",
					"sections": [
						{
							"column-one": true,
							"text": true,
							"content": "Redesigning a conventional user flow tested allowed me to test my understanding of the design process. <span class=\"bold\">Shifting the perspective of our target user from a micro-view to a macro-view resulted in an application that my team did not invision at first</span>. Despite this, we are satisfied with the solution our application provides. Through this project I also had another opportunity to advance my design skills, through branding, and development skills, such as working with React.js."
						}
					]
				}
			]
		},
		{
			"name": "PORTFOLIO",
			"title": "Portfolio",
			"url": "portfolio",
			"type": "UI Design + Dev",
			"description": "Today’s professional atmosphere is more competitive than ever before. Being an undergraduate student who is applying to UI/UX design and engineering internships, I needed to have a website portfolio where I could display my projects and establish an online presence to potential employers. Building this portfolio would not only allow me to showcase my abilities as a designer and developer, but would also provide me an opportunity to apply the concepts and skills I have learned through my coursework and on my own time.",
			"info": [
				{
					"title": "Roles",
					"content": "Sole web designer and developer. Fully contributed to design and branding process."
				},
				{
					"title": "Design Tools",
					"content": "Sketch, Adobe XD, Illustrator, Photoshop"
				},
				{
					"title": "Development Tools",
					"content": "HTML, CSS, Node.js (Express + Handlebars), Sass, Gulp"
				},
				{
					"title": "Skills",
					"content": "Visual design, brand design, UI design, front-end development, back-end development"
				},
				{
					"title": "Date",
					"content": "Mar 2018 - May 2018"
				},
				{
					"title": "Resources",
					"content": "<a href=\"https://github.com/alphyne/portfolioV2\">Github Repo</a>"
				}
			],
			"blocks": [
				{
					"header": "Objective",
					"sections": [
						{
							"column-two": true,
							"text": true,
							"content": "To showcase my adaptive skillset by designing and developing my personal website portfolio."
						}
					]
				},
				{
					"header": "Research",
					"sections": [
						{
							"column-two": true,
							"text": true,
							"content": "As someone who grew up alongside the expansion of the internet, I have been exposed to countless examples of web design. There are multitudes of interfaces that I visit and interact with everyday, each with their own purpose, however I had to figure out what constitutes an engaging personal portfolio."
						},
						{
							"column-one": true,
							"text": true,
							"content": "To begin exploring, I scrolled through portfolios created by experienced UI/UX designers and analyzed the design choices made for each one. Many URLs and mouse-clicks later, I began to get a feel for the unique brand identity each portfolio conveyed. A few in particular that stood out to me were <a href=\"http://www.rachel-schmitz.com\">rachel-schmitz.com</a> , <a href=\"http://www.dorothywong.design\">dorothywong.design</a> and <a href=\"http://jonathanhowell.com\">jonathanhowell.com</a>. This is because of their clean aesthetics and professional, yet fun personality."
						},
						{
							"column-one": true,
							"subheader": true,
							"title": "Inspiration",
							"image": true,
							"text": true,
							"src": "/images/portfolio/moodboard.gif",
							"content": "Before designing my portfolio, I decided search for more inspiration and dive further into my headspace. I knew that my portfolio would be a space for me to share my projects, but it is also a reflection of my identity and design style. With this in mind I collaged a moodboard of magazine spreads that balanced content in a bold and clean fashion. One of my personal principles is living a life in balance, and I thought these examples expressed the duality nicely."
						}
					]
				},
				{
					"header": "Final Design",
					"sections": [
						{
							"column-one": true,
							"subheader": true,
							"title": "Mockups",
							"text": true,
							"content": "I truly think that a picture is worth a thousand words, and so I wanted my portfolio to focus on showing-not-telling my projects. To complement this idea, I designed my portfolio with an emphasis on graphics in order to illustrate visual storytelling. I decided to have my portfolio maintain a grayscale color theme with offset sections of text. This way images and colors capture the attention of the reader and guide them down each page."
						},
						{
							"column-one": true,
							"image": true,
							"src": "/images/portfolio/mockups.gif"
						}
					]
				},
				{
					"header": "Development",
					"sections": [
						{
							"column-one": true,
							"text": true,
							"content": "As an aspiring developer, I thought it would be a great idea to push myself and build my portfolio from the ground up. Utilizing the knowledge of HTML, CSS, and Javascript from my coursework, I was able to develop my portfolio. In addition, I was also able to apply self-taught skills that I learned such as Sass, Gulp, and Node.js (Express + Handlebars). You can view my Github repo of this project <a href=\"https://github.com/alphyne/portfolioV2\">here</a>!"
						}
					]
				},
				{
					"header": "Takeaways",
					"sections": [
						{
							"column-one": true,
							"text": true,
							"content": "Challenging myself to build my portfolio from scratch allowed me to expand on my skills in visual design, UX design, and front-end development. Experiencing the design process firsthand on a project that represents my <span class=\"bold\">digital identity</span> and capabilities as a designer and developer inspired me to delve deeper into <span class=\"bold\">understanding the potential impact designers have on the world</span>."
						}
					]
				}
			]
		},
		{
			"name": "BLYSS",
			"title": "Blyss",
			"url": "blyss",
			"type": "Interaction Design + Dev",
			"description": "People are constantly connected to the world around them. Personal thoughts flood social media, creating a space that revolves around sharing, leaving little breathing room for privacy. Blyss is a mobile web application where people can chronicle their thoughts, reflect on their emotions, and gain insight on their personal lifestyle patterns.",
			"info": [
				{
					"title": "Roles",
					"content": "Led brand design and development of prototype. UX research and testing completed as team."
				},
				{
					"title": "Design + Dev Tools",
					"content": "Sketch, HTML, CSS, Node.js (Express + Handlebars)"
				},
				{
					"title": "Team",
					"content": "Bradley Arca, Judy Chun"
				},
				{
					"title": "Skills",
					"content": "Needfinding, rapid prototyping, wireframing, A/B testing, visual design, front-end development"
				},
				{
					"title": "Date",
					"content": "Jan 2018 - Mar 2018 (10 weeks)"
				},
				{
					"title": "Resources",
					"content": "<a href=\"https://github.com/alphyne/Blyss\">Github repo</a>"
				}
			],
			"blocks": [
				{
					"header": "Design Brief",
					"sections": [
						{
							"column-one": true,
							"text": true,
							"content": "With the help of digital devices, we have an unprecedented ability to track our behaviors, habits, and thoughts. But turning data about ourselves and our communities into valuable insights is still remarkably difficult. Our team’s objective was to explore ways to support monitoring, reflection, and behavior change by collecting, consuming, and sharing personally relevant information."
						}
					]
				},
				{
					"header": "Needfinding",
					"sections": [
						{
							"column-two": true,
							"text": true,
							"content": "My team interviewed three participants about their daily routines and observed their behaviors throughout the course of the day. During observation we would periodically ask our participants to reflect on a situation or activity that occurred and asked relevant follow-up questions."
						},
						{
							"column-one": true,
							"text": true,
							"content": "Based on the data we collected, my team discovered that our participants were so engrossed in their daily responsibilities that they often did not take time to relax nor incorporate self-care time into their schedules."
						},
						{
							"column-one": true,
							"quote": true,
							"content": "\"I tend to jump from one thing to the next. Sometimes I feel like I don’t have time to sit down and enjoy myself.\""
						},
						{
							"column-one": true,
							"text": true,
							"content": "After analyzing our user research, we refined our results and pain points into the following prompts:"
						},
						{
							"column-one": true,
							"bullet-list": true,
							"content": "<li>• How might we help users gain insight about themselves emotionally and mentally?</ul><ul>• How can we catalog a user’s feelings in a given day?</ul><ul>• How might we remind users about the activities and content that make them happy?</ul>"
						}
					]
				},
				{
					"header": "Solution",
					"sections": [
						{
							"column-two": true,
							"text": true,
							"content": "In order to encourage positive thinking, our solution was an application that composes an anthology of moments and media for users to reflect on, ultimately boosting their mood. Users can make posts to a personal feed that include details of how they were feeling at a certain time and any accompanying media, such as a song, photo, or video."
						},
						{
							"column-one": true,
							"text": true,
							"content": "Because the topic of our design brief is about inciting change from personal data, we decided to include an insights page where users can view breakdowns of their moods and receive suggestions on how to boost their well being. Suggestions can range from a funny video from the day before or reminders of positive moments that happened during the week."
						}
					]
				},
				{
					"header": "Storyboarding",
					"sections": [
						{
							"column-one": true,
							"text": true,
							"content": "To further understand our target users, my team drew storyboards with possible scenarios in which our app could be used."
						},
						{
							"column-one": true,
							"image": true,
							"src": "images/blyss/storyboard.gif"
						}
					]
				},
				{
					"header": "Personas",
					"sections": [
						{
							"column-one": true,
							"text": true,
							"content": "Building off of our storyboards, we came up with personas that represent the various needs and problems our solution is aiming to resolve."
						},
						{
							"column-one": true,
							"video": true,
							"content": "<div style=\"padding:56.25% 0 0 0;position:relative;\"><iframe src=\"https://player.vimeo.com/video/253919815?title=0&byline=0&portrait=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div><script src=\"https://player.vimeo.com/api/player.js\"></script>"
						}
					]
				},
				{
					"header": "Rapid Prototyping",
					"sections": [
						{
							"column-one": true,
							"text": true,
							"content": "Our prototype focused on the user flow and interaction of creating and viewing posts. After testing we had our users score our application using usability heuristics."
						},
						{
							"column-one": true,
							"image": true,
							"src": "images/blyss/paper-prototype.gif"
						}
					]
				},
				{
					"header": "Wireframing",
					"sections": [
						{
							"column-one": true,
							"text": true,
							"content": "Next, we created high-fidelity wireframes based on our paper prototype to visualize the flow of our application."
						},
						{
							"column-one": true,
							"image": true,
							"src": "images/blyss/wireframes.gif"
						}
					]
				},
				{
					"header": "Brand Design + Style Guide",
					"sections": [
						{
							"column-two": true,
							"image-and-text": true,
							"src": "images/blyss/style-guide.gif",
							"content": "Our styling approach is inspired by social media apps, such as Instagram and Twitter, so we incorporated similar design standards. Some elements we decided to use are a vertical scrolling chronological feed, a bottom-navigation bar, and an interface with generous white space and one accent color."
						}
					]
				},
				{
					"header": "Development",
					"sections": [
						{
							"column-two": true,
							"text": true,
							"content": "To develop our live prototype, we utilized resources including HTML, CSS, Javascript, and Node.js (Express + Handlebars). Our goal was to implement our core functions and ensure our app was responsive and fluid."
						}
					]
				},
				{
					"header": "A/B Testing",
					"sections": [
						{
							"column-two": true,
							"image-and-text": true,
							"src": "images/blyss/ab-test.gif",
							"content": "Because our app’s objective is to provide insight and self-awareness to users, we conducted an A/B test on the curated content page. Version A of this page shows users posts only tagged as ‘Happy’, providing quick access to media that is associated with positivity, while Version B gives users the option to view all of their posts by category of emotion. After reviewing the results of our A/B Test and T-Test, we concluded that Version B of the curated content page is more beneficial to users, due to the fact that it provides a larger range of information and more user engagement."
						}
					]
				},
				{
					"header": "Final Prototype",
					"sections": [
						{
							"column-one": true,
							"image-three": true,
							"src-1": "images/blyss/prototype-1.gif",
							"src-2": "images/blyss/prototype-2.gif",
							"src-3": "images/blyss/prototype-3.gif",
							"text": true,
							"content": "You can find the live prototype of our final design <a href=\"https://blyss.herokuapp.com/home\">here</a>!"
						}
					]
				},
				{
					"header": "Takeaways",
					"sections": [
						{
							"column-one": true,
							"text": true,
							"content": "This project was my first in-depth experience with the UX engineering process. From needfinding with user interviews to iterating on prototypes, I was able to contribute to the all stages of the design process. I learned that <span class=\"bold\">designers should watch what users do, not say</span> and that user feedback is the most valuable tool to utilize when designing. This is because a <span class=\"bold\">designer’s role is to create experiences not for themselves, but for the audience they are attempting to reach</span>. In addition, I realized the importance soft skills, such as communication and trust, when working as a team."
						}
					]
				}
			]
		}
	]
}

