{
	"projects": [
		{
			"name": "DEXCOM",
			"title": "Dexcom",
			"url": "dexcom",
			"description": "",
			"info": [
				{
					"title": "Title",
					"content": "UX Design Intern (IT)"
				},
				{
					"title": "Date",
					"content": "July 2018 - September 2018"
				}
			]
		},
		{
			"name": "BUROW",
			"title": "Burow",
			"url": "burow",
			"description": "",
			"info": [
				{
					"title": "Role",
					"content": "Visual design, front-end development, branding"
				},
				{
					"title": "Design Tools",
					"content": "Sketch, Illustrator"
				},
				{
					"title": "Development Tools",
					"content": "HTML, CSS, Javascript, Node.js, React, API Linking"
				},
				{
					"title": "Team",
					"content": "Aman Gupta, Emily Nguyen, Joel Sequeira"
				},
				{
					"title": "Date",
					"content": "April 2018 - June 2018"
				}
			],
			"blocks": [
				{
					"title": "Objective",
					"text": true,
					"content": "Develop a full-stack application focusing on interacting with real world data."
				},
				{
					"title":"Work In Progress",
					"text": true,
					"caption": "Brought together by the UC San Diego course, ENG100D - Design for Development, our team is diligently working on the development of this project. Stay tuned for more details!"
				}
			]
		},
		{
			"name": "BLYSS",
			"title": "Blyss",
			"url": "blyss",
			"description": "",
			"info": [
				{
					"title": "Role",
					"content": "Visual design, web development"
				},
				{
					"title": "Tools",
					"content": "HTML, CSS, JavaScript, Node.js (Express + Handlebars)"
				},
				{
					"title": "Team",
					"content": "Bradley Arca, Judy Chun"
				},
				{
					"title": "Date",
					"content": "January 2018 - March 2018"
				}
			],
			"blocks": [
				{
					"title": "Objective",
					"text": true,
					"content": "Design and develop a mobile web application focused on the principles of interaction design."
				},
				{
					"title": "The Quantified Self",
					"text": true,
					"content": "With the help of digital devices, we have an unprecedented ability to track our behaviors, habits, and thoughts. But turning data about ourselves and our communities into valuable insights is still remarkably difficult. My studio explored ways to support monitoring, reflection, and behavior change by collecting, consuming, and sharing personally relevant information. We considered how might we help people learn more about their everyday lives through self-tracking, and how might we help people draw insights from the mass of data they collect about themselves."
				},
				{
					"title": "Who is Our Audience?",
					"text": true,
					"content": "This section is currently under construction, check back later for updates!"
				},
				{
					"title":"Final Touches",
					"link": true,
					"linkurl": "https://blyss.herokuapp.com/",
					"content": "Come check out the live prototype here!"

				}
			]
		},
		{
			"name": "PORTFOLIO",
			"title": "Portfolio",
			"url": "portfolio",
			"type": "UI Design & Dev",
			"description": "Today’s professional atmosphere is more competitive than ever before. Being an undergraduate student who is applying to UI/UX design and engineering internships, I needed to have a website portfolio where I could display my projects and establish an online presence to potential employers. Building this portfolio would not only allow me to showcase my abilities as a designer and developer, but would also provide me an opportunity to apply the concepts and skills I have learned through my coursework and on my own time.",
			"info": [
				{
					"title": "Roles",
					"content": "Sole web designer and developer. Fully contributed to design and implementation processes."
				},
				{
					"title": "Design Tools",
					"content": "Sketch, Adobe XD, Illustrator, Photoshop"
				},
				{
					"title": "Development Tools",
					"content": "HTML, CSS, Node.js (Express + Handlebars), Sass, Gulp"
				},
				{
					"title": "Skills",
					"content": "Visual design, branding, UI design, front-end development, back-end development"
				},
				{
					"title": "Date",
					"content": "March 2018 - Current"
				},
				{
					"title": "Resources",
					"content": "<a href=\"https://github.com/alphyne/portfolioV2\">Github Repo</a>"
				}
			],
			"blocks": [
				{
					"header": "Objective",
					"sections": [
						{
							"column-two": true,
							"text": true,
							"content": "To showcase my adaptive skillset by designing and developing my personal website portfolio."
						}
					]
				},
				{
					"header": "Research",
					"sections": [
						{
							"column-two": true,
							"text": true,
							"content": "As someone who grew up alongside the expansion of the internet, I have been exposed to countless examples of web design. There are multitudes of interfaces that I visit and interact with everyday, each with their own purpose, however I had to figure out what constitutes an engaging personal portfolio."
						},
						{
							"column-one": true,
							"text": true,
							"content": "To begin exploring, I scrolled through portfolios created by experienced UI/UX designers and analyzed the design choices made for each one. Many URLs and mouse-clicks later, I began to get a feel for the unique brand identity each portfolio conveyed. A few in particular that stood out to me were <a href=\"http://www.rachel-schmitz.com\">rachel-schmitz.com</a> , <a href=\"http://www.dorothywong.design\">dorothywong.design</a> and <a href=\"http://jonathanhowell.com\">jonathanhowell.com</a>. This is because of their clean aesthetics and professional, yet fun personality."
						},
						{
							"column-one": true,
							"subheader": true,
							"title": "Inspiration",
							"image": true,
							"text": true,
							"src": "/images/portfolio/moodboard.gif",
							"content": "Before designing my portfolio, I decided search for more inspiration and dive further into my headspace. I knew that my portfolio would be a space for me to share my projects, but it is also a reflection of my identity and design style. With this in mind I collaged a moodboard of magazine spreads that balanced content in a bold and clean fashion. One of my personal principles is living a life in balance, and I thought these examples expressed the duality nicely."
						}
					]
				},
				{
					"header": "Final Design",
					"sections": [
						{
							"column-one": true,
							"subheader": true,
							"title": "Mockups",
							"text": true,
							"content": "I truly think that a picture is worth a thousand words, and so I wanted my portfolio to focus on showing-not-telling my projects. To complement this idea, I designed my portfolio with an emphasis on graphics in order to illustrate visual storytelling. I decided to have my portfolio maintain a grayscale color theme with offset sections of text. This way images and colors capture the attention of the reader and guide them down each page."
						},
						{
							"column-one": true,
							"image": true,
							"src": "/images/portfolio/mockups.gif"
						}
					]
				},
				{
					"header": "Development",
					"sections": [
						{
							"column-one": true,
							"text": true,
							"content": "As an aspiring developer, I thought it would be a great idea to push myself and build my portfolio from the ground up. Utilizing the knowledge of HTML, CSS, and Javascript from my coursework, I was able to develop my portfolio. In addition, I was also able to apply self-taught skills that I learned such as Sass, Gulp, and Node.js (Express + Handlebars). You can view my Github repo of this project <a href=\"https://github.com/alphyne/portfolioV2\">here</a>!"
						}
					]
				},
				{
					"header": "Takeaways",
					"sections": [
						{
							"column-one": true,
							"text": true,
							"content": "Challenging myself to build my portfolio from scratch allowed me to expand on my skills in visual design, UX design, and front-end development. Experiencing the design process firsthand on a project that represents my digital identity and capabilities as a designer and developer inspired me to delve deeper into understanding the potential impact designers have on the world."
						}
					]
				}
			]
		}
	]
}

